<h1> Attrition Model Building Project </h1>
<h2> Problem Statement </h2>
HRBP 로서 Attrition 관리의 중요성을 알고 퇴사하는 임직원에 대한 데이터를 검토 후 퇴사에 영향을 미치는 Factor 를 분석하여
퇴사확율을 구하여 해당 인력의 퇴사 가능성을 낮추는 데 분석의 목적이 있다.

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 데이터 불러오기
df = pd.read_excel("resources/ATTRITION DATA.xlsx")
df.head()

,e_code,status,hire_date,service_agreement,job_level,performance_rating_2018,performance_rating_2017,year_of_birth,gender,distance_from_home,...,potential_rating,bonus,no_courses_taken,time_in_position,awards,signon,manager_sat,employee_sat,salary_2017,salary_2018
0,45631,0,1990-09-17,N,3,4,3,1967,M,0.52,...,5,0,8,30,N,N,81,80,119968,124173
1,45632,0,1995-10-23,N,2,1,2,1971,M,0.08,...,5,2242,6,5,N,N,88,84,99330,100822
2,45633,0,1996-03-10,N,2,4,4,1972,M,0.51,...,3,0,2,53,N,N,83,93,102511,115500
3,45634,0,1998-07-13,N,1,3,3,1968,F,0.81,...,5,2320,2,36,N,N,86,83,56674,58806
4,45635,0,1991-09-16,N,2,3,3,1961,M,0.06,...,5,0,10,2,N,N,79,80,122021,122021

In [3]:
df.shape

(686, 23)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 686 entries, 0 to 685
Data columns (total 23 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   e_code                   686 non-null    int64
 1   status                   686 non-null    int64
 2   hire_date                686 non-null    datetime64[ns]
 3   service_agreement        686 non-null    object
 4   job_level                686 non-null    int64
 5   performance_rating_2018  686 non-null    int64
 6   performance_rating_2017  686 non-null    int64
 7   year_of_birth            686 non-null    int64
 8   gender                   686 non-null    object
 9   distance_from_home       686 non-null    float64
 10  manager_changes          686 non-null    int64
 11  no_of_promotions         686 non-null    int64
 12  risk_of_attrition        686 non-null    int64
 13  potential_rating         686 non-null    int64
 14  bonus                    686 non-null    int64
 15  no_courses_taken         686 non-null    int64
 16  time_in_position         686 non-null    int64
 17  awards                   686 non-null    object
 18  signon                   686 non-null    object
 19  manager_sat              686 non-null    int64
 20  employee_sat             686 non-null    int64
 21  salary_2017              686 non-null    int64
 22  salary_2018              686 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(17), object(4)
memory usage: 123.4+ KB

In [5]:
df.describe()

,e_code,status,job_level,performance_rating_2018,performance_rating_2017,year_of_birth,distance_from_home,manager_changes,no_of_promotions,risk_of_attrition,potential_rating,bonus,no_courses_taken,time_in_position,manager_sat,employee_sat,salary_2017,salary_2018
count,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000,686.000000
mean,46015.237609,0.247813,1.753644,2.895044,2.967930,1972.532070,3.204534,2.332362,0.615160,2.558309,3.693878,1097.536443,3.247813,27.345481,82.177843,81.214286,114289.116618,119135.456268
std,214.878836,0.432058,0.957007,1.124669,0.674125,7.734348,8.441646,2.431611,1.190229,0.734119,1.088570,2128.097198,3.063291,31.375641,4.838758,5.005909,60820.924620,60925.702367
min,45631.000000,0.000000,1.000000,1.000000,1.000000,1959.000000,0.000000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000,0.000000,76.000000,70.000000,39600.000000,43903.000000
25%,45833.250000,0.000000,1.000000,2.000000,3.000000,1966.000000,0.242500,0.000000,0.000000,2.000000,3.000000,0.000000,1.000000,7.000000,79.000000,80.000000,77033.750000,81840.000000
50%,46017.500000,0.000000,1.000000,3.000000,3.000000,1973.000000,0.450000,2.000000,0.000000,3.000000,4.000000,0.000000,2.000000,18.000000,79.000000,80.000000,98000.000000,102716.000000
75%,46199.750000,0.000000,2.000000,4.000000,3.000000,1979.000000,0.980000,4.000000,1.000000,3.000000,5.000000,2051.000000,4.000000,37.000000,85.000000,80.000000,125705.500000,132000.000000
max,46387.000000,1.000000,5.000000,5.000000,4.000000,1990.000000,50.000000,15.000000,10.000000,4.000000,5.000000,19853.000000,20.000000,278.000000,100.000000,100.000000,511500.000000,511500.000000

In [1]:
import pandas_profiling
profile = pandas_profiling.ProfileReport(df=df,minimal=True)
profile.to_widgets()

NameError: name 'df' is not defined

In [9]:
# Feature Engineering
df["var_rating"] = df["performance_rating_2018"] - df["performance_rating_2017"]
df["var_rating"]

0      1
1     -1
2      0
3      0
4      0
      ..
681    0
682   -1
683    0
684    0
685    0
Name: var_rating, Length: 686, dtype: int64

In [10]:
df["performance_rating_2018"] = (df["salary_2018"]-df["salary_2017"]) / df["salary_2017"] * 100
df["performance_rating_2018"]

0       3.505101
1       1.502064
2      12.670835
3       3.761866
4       0.000000
         ...
681     1.201349
682     1.201349
683     1.201349
684     1.201349
685     2.567568
Name: performance_rating_2018, Length: 686, dtype: float64

In [11]:
df.columns

Index(['e_code', 'status', 'hire_date', 'service_agreement', 'job_level',
       'performance_rating_2018', 'performance_rating_2017', 'year_of_birth',
       'gender', 'distance_from_home', 'manager_changes', 'no_of_promotions',
       'risk_of_attrition', 'potential_rating', 'bonus', 'no_courses_taken',
       'time_in_position', 'awards', 'signon', 'manager_sat', 'employee_sat',
       'salary_2017', 'salary_2018', 'var_rating'],
      dtype='object')

In [12]:
df["age"] = 2018-df["year_of_birth"]
df["age"]

0      51
1      47
2      46
3      50
4      57
       ..
681    52
682    37
683    51
684    38
685    55
Name: age, Length: 686, dtype: int64